In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("master_df.csv")
df.head()

       country visa_type  number
0  Afghanistan        A1      14
1  Afghanistan        A2      42
2  Afghanistan        B1       1
3  Afghanistan     B1/B2      87
4  Afghanistan        F2       1

In [3]:
df.tail()

         country visa_type  number
142183  Zimbabwe        G1      11
142184  Zimbabwe        G4      13
142185  Zimbabwe        J1       2
142186  Zimbabwe        K1       1
142187  Zimbabwe        M1       1